app/controllers/courses_controller.rb

  def index
    if params[:search].present?
      @courses = Course.where("course_id LIKE ? OR course_title LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%").paginate(page: params[:page], per_page: 10)
    else
      @courses = Course.paginate(page: params[:page], per_page: 10)
---
SELECT COUNT(*) FROM "courses"