app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @course = Course.find(id) # look up movie by unique ID

SELECT "courses".* FROM "courses" WHERE (course_number LIKE '%test%' OR course_title LIKE '%test%')
---
  def index
    @courses = Course.all

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @course = Course.find params[:id]

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "courses" SET "project" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["project", "f"], ["updated_at", "2023-11-02 01:52:48.045323"], ["id", 6]]
---
  def update
    @course = Course.find params[:id]
    @course.update_attributes!(course_params)